# ============================================================
# Proposed Hybrid Model (Experiment 2)
# Full YOLOv11n backbone  +  YOLOv8n head / neck
# 3-class skin burn detection: first-, second-, third-degree
# ============================================================
# NOTE: Replace this with the EXACT yaml you trained if you have it,
# so model.info() reports 2.25M params / 2.25 GFLOPs.
# Confirm the C2PSA line and the head Concat indices match your model.

nc: 3  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # nano

# ---------------- YOLOv11n backbone (full replacement) ----------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2
  - [-1, 1, Conv,  [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4
  - [-1, 1, Conv,  [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2,  [512, True]]         # 6
  - [-1, 1, Conv,  [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2,  [1024, True]]        # 8
  - [-1, 1, SPPF,  [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]              # 10  <-- keep ONLY if you used C2PSA; else delete and shift head indices

# ---------------- YOLOv8n head / neck (PAN-FPN) ----------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12  cat backbone P4
  - [-1, 3, C2f, [512]]                          # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15  cat backbone P3
  - [-1, 3, C2f, [256]]                          # 16  (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18  cat head P4
  - [-1, 3, C2f, [512]]                          # 19  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21  cat backbone P5 (SPPF/C2PSA out)
  - [-1, 3, C2f, [1024]]                         # 22  (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]              # 23  Detect(P3, P4, P5)
